[TUT_Batarang_Corners]
01=Aim and throw Batarangs without being seen when you are in Corner Cover.
02=Move to the corner and peak around it.
03=With the Batarang selected you can aim and throw it around corners without being seen.

[TUT_Stun_Stick_Thugs]
01=Use Batman's evade move to quickly dodge over thugs carrying Stun Batons.
02=Double Tap + Direction - Evade
